#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_acm_certificate.certificate: Refreshing state... [id=arn:aws:acm:us-east-1:439793709230:certificate/c4e92cdb-24c0-441c-94db-b3f4abbed378]
aws_cloudfront_origin_access_control.default: Refreshing state... [id=EV1HZVTQ1U0BW]
aws_s3_bucket.s3-bucket: Refreshing state... [id=caitlingbailey.com]
data.aws_route53_zone.zone: Reading...
aws_acm_certificate_validation.cert: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]
data.aws_route53_zone.zone: Read complete after 0s [id=Z05129602064YT69ODB82]
aws_s3_bucket_public_access_block.website_bucket_access: Refreshing state... [id=caitlingbailey.com]
aws_cloudfront_distribution.cdn_static_website: Refreshing state... [id=E2ZTE2KW0H2XW9]
aws_route53_record.www: Refreshing state... [id=Z05129602064YT69ODB82_www.caitlingbailey.com_A]
aws_route53_record.apex: Refreshing state... [id=Z05129602064YT69ODB82_caitlingbailey.com_A]
data.aws_iam_policy_document.website_bucket: Reading...
data.aws_iam_policy_document.website_bucket: Read complete after 0s [id=378548393]
aws_s3_bucket_policy.website_bucket_policy: Refreshing state... [id=caitlingbailey.com]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_s3_bucket.s3-bucket-test will be created
  + resource "aws_s3_bucket" "s3-bucket-test" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "caitlingbailey-test"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>